##### **Pandas groupby** is a function for grouping data objects into Series (columns) or DataFrame (a group of Series) based on particular indicators. In simpler terms, group by in Python makes the management of datasets easier since you can put related records into groups.

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({
    "Employee": ["Susan", "Elina", "Jordan", "Charles", "David", "Charles", "Julia", "Bart"],
    "City": ["London", "London", "Philadelphia", "London", "London", "Philadelphia", "London","Philadelphia"],
    "Product": [20, 40, 18, 24, 37, 40, 44, 20],
    "Hours": [24, 40, 50, 36, 54, 44, 41, 35]})
df

  Employee          City  Product  Hours
0    Susan        London       20     24
1    Elina        London       40     40
2   Jordan  Philadelphia       18     50
3  Charles        London       24     36
4    David        London       37     54
5  Charles  Philadelphia       40     44
6    Julia        London       44     41
7     Bart  Philadelphia       20     35

### Grouping Function

In [ ]:
df.groupby(['Employee']).sum()

In [7]:
#count how many employee are from same city
df.groupby(['City']).count()

              Employee  Product  Hours
City
London               5        5      5
Philadelphia         3        3      3

In [8]:
df.groupby('Employee')['Hours'].sum()

Employee
Bart       35
Charles    80
David      54
Elina      40
Jordan     50
Julia      41
Susan      24
Name: Hours, dtype: int64

In [9]:
df.groupby('Employee')['Hours'].sum().reset_index()

  Employee  Hours
0     Bart     35
1  Charles     80
2    David     54
3    Elina     40
4   Jordan     50
5    Julia     41
6    Susan     24

In [10]:
#sort based on hours value
df.groupby('Employee')['Hours'].sum().reset_index().sort_values(by='Hours')

  Employee  Hours
6    Susan     24
0     Bart     35
3    Elina     40
5    Julia     41
4   Jordan     50
2    David     54
1  Charles     80

In [ ]:
df.groupby('Employee').mean().reset_index()